basecase/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour);

liquid
{
    transportModel  		Newtonian;
    nu              		nu [ 0 2 -1 0 0 0 0 ] 1.983e-7;  //mu = 2.658e-4 Pa s
    rho             		rho [ 1 -3 0 0 0 0 0 ] 1342.4;
    kappa			 0.0714;
    Cp				 1250;
}

vapour
{
    transportModel		Newtonian;
    nu				nu [ 0 2 -1 0 0 0 0 ] 5.11e-7;   //mu = 1.119e-5
    rho			rho [ 1 -3 0 0 0 0 0 ] 21.57;
    kappa			0.013107;
    Cp				898;
    Hf              0.0;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.008933;
sigmaRhoCorrection false;


reconstructionScheme    isoAlpha;


curvatureSmoothingIterations 2;
alphaInterfaceOnly yes;
curvatureModel
{
    type gradAlpha;
    KSmoothingIter  4;
}

deltaModel
{
    type gradAlpha;
}

PhaseChangeProperties
{
    Tsat            303.65;
    R               52.68;  //(8.134/152.04)*1000
    sigmaEvap       1.0;
    DmDot           1.0e-11;
    hf              1.4242e5;

}
// Rint = 2*Hevap*rhoV*rhoL/sqrt(2*pi*R)/(rhoL-rhoV)/Tsat^1.5 = 390.5 Kg/m^2 s K
// Rvapour = 461.5 J/kg K
// Aspec = interfacialArea/V = 1e3 1/m
// coeffC = Aspec*Rint/rhoV = 1.17e4 1/s K
// coeffE = Aspec*Rint/rhoL = 7.3 1/s K

// ************************************************************************* //
