basecase/0.orig/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    
     inlet
    {
       type            fixedFluxPressure;
    }
    
    outlet
    {
        type 		fixedValue;
        value 		uniform 0;
       
    }
    
    heater
    {
       type            zeroGradient;
    }
        
    
    topWall
    {
        type            zeroGradient;
    }
        
    
    "pin.*|Pin.*"
    {
        type            zeroGradient;
        
    }
    
    "(rightWall|leftWall)"
    {
        type           cyclic;       
    }
}


// ************************************************************************* //
